cask_args appdir: '/Applications', require_sha: true

# ============================================
# Mac App Store
# ============================================
brew 'mas'                   # Mac App Store CLI
mas 'Flighty', id: 1358823008
mas 'Xcode', id: 497799835

# ============================================
# Services / Databases
# ============================================
brew 'postgresql@14'
brew 'postgresql@15'
brew 'postgresql@16'
brew 'valkey'

# ============================================
# Build dependencies
# ============================================
brew 'imagemagick'
brew 'libpq'
brew 'libyaml'
brew 'openssl@3'
brew 'vips'

# ============================================
# Core CLI tools
# ============================================
brew 'git'
brew 'gh'                    # GitHub CLI
brew 'tmux'
brew 'mise'                  # Runtime version manager
brew 'fzf'                   # Fuzzy finder
brew 'ripgrep'               # Better grep
brew 'fd'                    # Better find
brew 'bat'                   # Better cat
brew 'eza'                   # Better ls
brew 'zoxide'                # Better cd
brew 'atuin'                 # Better shell history
brew 'starship'              # Fast prompt
brew 'zsh-syntax-highlighting'
brew 'jaq'                   # Better jq (Rust)
brew 'yq'                    # YAML processor
brew 'yj'                    # Convert YAML/JSON/TOML
brew 'trash'                 # Safe rm (macOS)
brew 'vim'
brew 'neovim'                # Better vim

# ============================================
# Modern CLI replacements
# ============================================
brew 'btop'                  # Better top/htop
brew 'duf'                   # Better df
brew 'dust'                  # Better du
brew 'procs'                 # Better ps
brew 'delta'                 # Better git diff
brew 'tldr'                  # Simplified man pages
brew 'glow'                  # Markdown viewer
brew 'xh'                    # Better curl (HTTPie-like)
brew 'sd'                    # Better sed (simpler syntax)
brew 'doggo'                 # Better dig (DNS lookup)
brew 'grex'                  # Generate regex from examples
brew 'ouch'                  # Universal compress/decompress

# ============================================
# Git tools
# ============================================
brew 'lazygit'               # Git TUI
brew 'tig'                   # Git history TUI
brew 'diff-so-fancy'         # Diff highlighter
brew 'git-lfs'               # Large file storage
brew 'jj'                    # Jujutsu - Git-compatible VCS

# ============================================
# Dev tools
# ============================================
brew 'just'                  # Task runner
brew 'overmind'              # Procfile manager
brew 'hyperfine'             # Benchmarking
brew 'tokei'                 # Code statistics
brew 'dive'                  # Docker image explorer
brew 'lazydocker'            # Docker TUI
brew 'watch'
brew 'entr'                  # File watcher
brew 'zellij'                # Terminal multiplexer
brew 'wakatime-cli'          # Coding time tracker
brew 'max-sixty/worktrunk/wt'

# ============================================
# Cloud / Infra
# ============================================
brew 'doctl'                 # DigitalOcean CLI
brew 'cloudflared'           # Cloudflare tunnel
brew 'railway'               # Railway CLI
brew 'rclone'                # Cloud storage sync
brew 'helm'                  # Kubernetes package manager
brew 'nmap'                  # Network scanner

# ============================================
# Media / Files
# ============================================
brew 'ffmpeg'                # Video processing
brew 'wget'                  # Download files
brew 'transmission-cli'
brew 'fastfetch'             # System info

# Browsers
cask 'firefox'
cask 'google-chrome', args: { require_sha: false }
cask 'google-chrome@dev', args: { require_sha: false }
cask 'sizzy', args: { require_sha: false }

# Chats
cask 'beeper'
cask 'discord'
cask 'readdle-spark'
cask 'slack'

# Tools
cask '1password'
cask 'claude'
cask 'home-assistant'
cask 'aldente'
cask 'alt-tab'
cask 'atuin-desktop'
cask 'balenaetcher'
cask 'betterdisplay'
cask 'cleanshot'
cask 'daisydisk', args: { require_sha: false }
cask 'flux-app'
cask 'hyperkey'
cask 'jordanbaird-ice'
cask 'keka'
cask 'linear-linear'
cask 'nordvpn'
cask 'notion-calendar'
cask 'notion'
cask 'ollama-app'
cask 'raycast'
cask 'scroll-reverser'
cask 'tailscale-app'
cask 'transmission'
cask 'utm'
cask 'voiceink'

# Media
cask 'iina'
cask 'multiviewer'
cask 'obs'
cask 'spotify', args: { require_sha: false }
cask 'vlc@nightly'
cask 'riverside-studio', args: { require_sha: false }

# Devtools
cask '1password-cli'
cask 'claude-code'
cask 'codex'
cask 'codex-app'
cask 'cursor'
cask 'cursor-cli'
cask 'opencode-desktop'
cask 'cyberduck'
cask 'font-fira-code-nerd-font'
cask 'ghostty'
cask 'jetbrains-toolbox'
cask 'kiro-cli'
cask 'lm-studio'
cask 'orbstack'
cask 'postico'
cask 'proxyman'
cask 'tableplus'
cask 'yaak'
cask 'zed'
cask 'steipete/tap/codexbar'
