cask_args appdir: '/Applications', require_sha: true

# Services
brew 'postgresql@14'
brew 'postgresql@15'
brew 'postgresql@16'
brew 'valkey'

# Utils
brew 'imagemagick'
brew 'libpq'
brew 'libyaml'
brew 'openssl'
brew 'vips'

# CLI
brew 'atuin'
brew 'bat'
brew 'btop'
brew 'cloudflared'
brew 'diff-so-fancy'
brew 'dive'
brew 'doctl'
brew 'eza'
brew 'fastfetch'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'hyperfine'
brew 'jq'
brew 'just'
brew 'lazydocker'
brew 'lazygit'
brew 'mise'
brew 'overmind'
brew 'ripgrep'
brew 'tig'
brew 'tmux'
brew 'transmission-cli'
brew 'trash-cli'
brew 'zoxide'
brew 'nmap'
brew 'helm'
brew 'watch'

# Browsers
cask 'firefox'
cask 'google-chrome', args: { require_sha: false }
cask 'google-chrome@dev', args: { require_sha: false }
cask 'sizzy', args: { require_sha: false }

# Chats
cask 'beeper'
cask 'discord'
cask 'readdle-spark'
cask 'slack'

# Tools
cask '1password'
cask 'aldente'
cask 'alt-tab'
cask 'atuin-desktop'
cask 'balenaetcher'
cask 'betterdisplay'
cask 'cleanshot'
cask 'daisydisk', args: { require_sha: false }
cask 'flux-app'
cask 'jordanbaird-ice'
cask 'keka'
cask 'linear-linear'
cask 'nordvpn'
cask 'notion-calendar'
cask 'notion'
cask 'ollama-app'
cask 'raycast'
cask 'scroll-reverser'
cask 'tailscale-app'
cask 'transmission'
cask 'utm'
cask 'voiceink'

# Media
cask 'iina'
cask 'multiviewer'
cask 'obs'
cask 'spotify', args: { require_sha: false }
cask 'vlc@nightly'
cask 'riverside-studio', args: { require_sha: false }

# Devtools
cask '1password-cli'
cask 'claude-code'
cask 'codex'
cask 'cursor'
cask 'cursor-cli'
cask 'cyberduck'
cask 'font-fira-code-nerd-font'
cask 'ghostty'
cask 'jetbrains-toolbox'
cask 'kiro-cli'
cask 'orbstack'
cask 'postico'
cask 'proxyman'
cask 'tableplus'
cask 'yaak'
cask 'zed'
